#+DATE: [2016-07-10 Sun 21:24]
#+BLOG: wordpress
#+POSTID: 824
#+OPTIONS: todo:t
#+TITLE: Visualizing relationships between python packages
#+AUTHOR: Robert Kozikowski
#+EMAIL: r.kozikowski@gmail.com
*** Load csv and verify edges with pandas
#+BEGIN_SRC ipython :session :exports none
  def arr_to_org(arr):
      line = "|".join(str(item) for item in arr)
      return "|{}|".format(line)


  def df_to_org(df):
      if len(df) <= 5:
          print "\n".join([arr_to_org(df.columns), "|-"] +
                          [arr_to_org(row) for row in df.values])
      else:
          print "\n".join([arr_to_org(df.columns), "|-"] +
                          [arr_to_org(row) for row in df.values[:5]] +
                          ["|{} more rows".format(len(df) - 5)])
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :session :results output raw drawer :exports both
  import pandas as pd
  import math

  df = pd.read_csv("edges.csv")
  pd_df = df[( df.package1 == "pandas" ) | ( df.package2 == "pandas" )]
  pd_df.loc[pd_df.package1 == "pandas","other_package"] = pd_df[pd_df.package1 == "pandas"].package2
  pd_df.loc[pd_df.package2 == "pandas","other_package"] = pd_df[pd_df.package2 == "pandas"].package1

  df_to_org(pd_df.loc[:,["other_package", "count"]])

  print "\n", len(pd_df), "total edges with pandas"
#+END_SRC

#+RESULTS:
:RESULTS:
| other_package | count |
|---------------+-------|
| pandas        | 33846 |
| numpy         | 21813 |
| statsmodels   |  1355 |
| seaborn       |  1164 |
| zipline       |   684 |
| 11 more rows  |       |

16 total edges with pandas
:END:
*** DataFrame with nodes
#+BEGIN_SRC ipython :session :results output raw drawer :exports both
  nodes_df = df[df.package1 == df.package2].reset_index().loc[:, ["package1", "count"]].copy()
  nodes_df["label"] = nodes_df.package1
  nodes_df["id"] = nodes_df.index
  nodes_df["r"] = (nodes_df["count"] / nodes_df["count"].min()).apply(math.sqrt) + 5
  nodes_df["count"].apply(lambda s: str(s) + " total usages\n")
  df_to_org(nodes_df)
#+END_SRC

#+RESULTS:
:RESULTS:
| package1       |   count | label      | id |             r |
|----------------+---------+------------+----+---------------|
| os             | 1005020 | os         |  0 |  75.711381704 |
| sys            |  784379 | sys        |  1 | 67.4690570169 |
| django         |  618941 | django     |  2 | 60.4915169887 |
| __future__     |  445335 | __future__ |  3 | 52.0701286903 |
| time           |  359073 | time       |  4 | 47.2662138808 |
| 3460 more rows |         |            |    |               |
:END:

*** Create map of node name -> id
#+BEGIN_SRC ipython :session :results output :exports both
  id_map = nodes_df.reset_index().set_index("package1").to_dict()["index"]

  print pd.Series(id_map).sort_values()[:5]
#+END_SRC

#+RESULTS:
: os            0
: sys           1
: django        2
: __future__    3
: time          4
: dtype: int64

*** Create edges data frame
#+BEGIN_SRC ipython :session :results output raw drawer :exports both
  edges_df = df.copy()
  edges_df["source"] = edges_df.package1.apply(lambda p: id_map[p])
  edges_df["target"] = edges_df.package2.apply(lambda p: id_map[p])
  edges_df = edges_df.merge(nodes_df[["id", "count"]], left_on="source", right_on="id", how="left")
  edges_df = edges_df.merge(nodes_df[["id", "count"]], left_on="target", right_on="id", how="left")
  df_to_org(edges_df)
  
  print "\ndf and edges_df should be the same length: ", len(df), len(edges_df)
#+END_SRC

#+RESULTS:
:RESULTS:
| package1        | package2   |       strength | count_x | source | target | id_x | count_y | id_y |   count |
|-----------------+------------+----------------+---------+--------+--------+------+---------+------+---------|
| os              | os         |            1.0 | 1005020 |      0 |      0 |    0 | 1005020 |    0 | 1005020 |
| sys             | sys        |            1.0 |  784379 |      1 |      1 |    1 |  784379 |    1 |  784379 |
| django          | django     |            1.0 |  618941 |      2 |      2 |    2 |  618941 |    2 |  618941 |
| __future__      | __future__ |            1.0 |  445335 |      3 |      3 |    3 |  445335 |    3 |  445335 |
| os              | sys        | 0.501429793505 |  393311 |      0 |      1 |    0 | 1005020 |    1 |  784379 |
| 11117 more rows |            |                |         |        |        |      |         |      |         |

df and edges_df should be the same length:  11122 11122
:END:

*** Add reversed edge
#+BEGIN_SRC ipython :session :results output raw drawer :exports both
  edges_rev_df = edges_df.copy()
  edges_rev_df.loc[:,["source", "target"]] = edges_rev_df.loc[:,["target", "source"]].values
  edges_df = edges_df.append(edges_rev_df)
  df_to_org(edges_df)
#+END_SRC

#+RESULTS:
:RESULTS:
| package1        | package2   |       strength | count_x | source | target | id_x | count_y | id_y |   count |
|-----------------+------------+----------------+---------+--------+--------+------+---------+------+---------|
| os              | os         |            1.0 | 1005020 |      0 |      0 |    0 | 1005020 |    0 | 1005020 |
| sys             | sys        |            1.0 |  784379 |      1 |      1 |    1 |  784379 |    1 |  784379 |
| django          | django     |            1.0 |  618941 |      2 |      2 |    2 |  618941 |    2 |  618941 |
| __future__      | __future__ |            1.0 |  445335 |      3 |      3 |    3 |  445335 |    3 |  445335 |
| os              | sys        | 0.501429793505 |  393311 |      0 |      1 |    0 | 1005020 |    1 |  784379 |
| 22239 more rows |            |                |         |        |        |      |         |      |         |
:END:

*** Truncate edges DataFrame 
#+BEGIN_SRC ipython :session :results output raw drawer :exports both
  edges_df = edges_df[["source", "target", "strength"]]
  df_to_org(edges_df)
#+END_SRC

#+RESULTS:
:RESULTS:
|          source | target |       strength |
|-----------------+--------+----------------|
|             0.0 |    0.0 |            1.0 |
|             1.0 |    1.0 |            1.0 |
|             2.0 |    2.0 |            1.0 |
|             3.0 |    3.0 |            1.0 |
|             0.0 |    1.0 | 0.501429793505 |
| 22239 more rows |        |                |
:END:
*** Truncate nodes DataFrame
#+BEGIN_SRC ipython :session :results output raw drawer :exports both
  # c will be collision strength. Prevent labels from overlaping.
  nodes_df["c"] = pd.DataFrame([nodes_df.label.str.len() * 1.8, nodes_df.r]).max() + 5
  nodes_df = nodes_df[["id", "r", "label", "c", "x", "y"]]
  df_to_org(nodes_df)
#+END_SRC

#+RESULTS:
:RESULTS:
|             id |             r | label      |             c |             x |              y |
|----------------+---------------+------------+---------------+---------------+----------------|
|              0 |  75.711381704 | os         |  80.711381704 |  158.70817237 |  396.074393369 |
|              1 | 67.4690570169 | sys        | 72.4690570169 | 362.371142521 | -292.138913114 |
|              2 | 60.4915169887 | django     | 65.4915169887 | 526.471326062 |  1607.83507287 |
|              3 | 52.0701286903 | __future__ | 57.0701286903 | 1354.91212894 |  680.325432179 |
|              4 | 47.2662138808 | time       | 52.2662138808 | 419.407448663 |  439.872927665 |
| 3460 more rows |               |            |               |               |                |
:END:
